{
  "headache": "Drink water and rest. If it persists, please consult a doctor.",
  "migraine": "Rest in a dark, quiet room and try relaxation techniques. Consult a healthcare professional if frequent.",
  "tired": "Try to get 7–8 hours of sleep and take short breaks during work.",
  "fatigue": "Ensure you're eating balanced meals and staying hydrated. Light exercise can help.",
  "fever": "Stay hydrated and rest. If high fever persists, see a doctor.",
  "cough": "Drink warm fluids and honey. If the cough persists for more than a week, consult a doctor.",
  "cold": "Rest, drink fluids, and consider vitamin C. Monitor your symptoms carefully.",
  "sore throat": "Gargle with warm salt water and drink soothing teas. Seek medical advice if pain continues.",
  "stomachache": "Rest, drink water, and avoid heavy meals. Seek medical attention if severe or persistent.",
  "nausea": "Sip water slowly, eat light foods, and rest. Consult a doctor if it continues.",
  "vomiting": "Stay hydrated and avoid solid food temporarily. Seek medical help if severe.",
  "diarrhea": "Drink fluids with electrolytes and rest. If symptoms persist, consult a doctor.",
  "constipation": "Increase fiber intake and drink plenty of water. Regular exercise can help.",
  "dizziness": "Sit or lie down immediately and drink water. Seek medical help if severe.",
  "back pain": "Maintain good posture, apply heat, and do light stretches. Consult a physiotherapist if persistent.",
  "neck pain": "Apply warm compresses, do gentle neck stretches, and maintain good posture.",
  "joint pain": "Light exercise and anti-inflammatory foods can help. Consult a doctor if severe.",
  "stress": "Practice deep breathing, meditation, and short breaks. Consider talking to a counselor.",
  "anxiety": "Try mindfulness exercises, deep breathing, and journaling. Seek professional help if needed.",
  "depression": "Talk to a trusted adult or counselor. Engage in physical activity and hobbies.",
  "sleep": "Maintain a regular sleep schedule and avoid screens before bed.",
  "insomnia": "Practice relaxation techniques and avoid caffeine in the evening.",
  "hydration": "Drink at least 6–8 glasses of water daily to stay hydrated.",
  "exercise": "Aim for at least 30 minutes of moderate activity most days.",
  "nutrition": "Eat a balanced diet with fruits, vegetables, protein, and whole grains.",
  "weight loss": "Combine regular exercise with a balanced diet. Avoid fad diets.",
  "weight gain": "Increase calorie intake with healthy foods and maintain strength training.",
  "eye strain": "Follow the 20-20-20 rule: every 20 minutes, look at something 20 feet away for 20 seconds.",
  "screen time": "Take regular breaks from screens and adjust brightness to reduce eye strain.",
  "hydration reminder": "Remember to drink water regularly throughout the day.",
  "sunburn": "Apply aloe vera, stay out of the sun, and keep skin moisturized.",
  "allergy": "Avoid allergens, take antihistamines if needed, and consult a doctor for severe reactions.",
  "cold symptoms": "Rest, drink fluids, and monitor for fever or worsening symptoms.",
  "flu": "Stay hydrated, rest, and consult a doctor if symptoms are severe.",
  "immune system": "Eat a healthy diet, exercise, and get adequate sleep to support immunity.",
  "mental health": "Take breaks, practice mindfulness, and speak to someone you trust if stressed.",
  "hydration tips": "Include water-rich foods like fruits and vegetables in your diet.",
  "healthy eating": "Prioritize vegetables, fruits, lean protein, and whole grains.",
  "vitamins": "Ensure adequate intake of essential vitamins through diet or supplements if necessary.",
  "mental fatigue": "Take short breaks, meditate, and avoid multitasking when stressed.",
  "workout": "Warm up before exercises and cool down afterward to prevent injuries.",
  "stretching": "Stretch daily to maintain flexibility and prevent muscle strain.",
  "headache relief": "Massage temples, stay hydrated, and rest in a quiet environment.",
  "cold relief": "Steam inhalation and warm fluids can ease congestion.",
  "flu prevention": "Wash hands frequently, get adequate rest, and consider vaccination.",
  "hydration alert": "Drink water before you feel thirsty to maintain energy and focus.",
  "healthy habits": "Establish routines for sleep, exercise, and nutrition for overall wellness.",
  "daily wellness": "Spend a few minutes meditating or journaling to support mental health.",
  "default": "I'm sorry. I have no advices for that.",
  "thanks": "You're welcome! I'm here to assist you:)",
  "thank you": "No problem. I'm glad to hear that."
}
